type Question = {
	question: string;
	answers: string[];
};

export const questions: Question[] = [
	{
		question: 'ถ้าเปรียบความรักของคุณตอนนี้เป็นสีคุณนึกถึงสีอะไร',
		answers: ['สีเหลือง', 'สีน้ำตาล', 'สีม่วง', 'สีฟ้า', 'สีชมพู'],
	},
	{
		question: 'ในวันสำคัญของคุณ คุณอยากได้ช่อดอกไม้แบบไหนมากที่สุด',
		answers: [
			'กุหลาบช่อใหญ่ดูหรูหรา',
			'ช่อลาเวนเดอร์แซมด้วยสีเขียวของใบสน',
			'ดอกเดซี่ช่อเล็กๆน่ารักและเรียบง่าย',
			'ดอกทานตะวันสีเหลืองอร่าม',
			'ดอกลิลลีสีขาวมัดเชือกแบบน่ารัก',
		],
	},
	{
		question:
			'ถ้าจะต้องอธิบายชีวิตของคุณด้วยฤดูต่างๆ ชีวิตของคุณเปรียบเสมือนฤดูอะไร',
		answers: ['ฤดูร้อน', 'ฤดูหนาว', 'ฤดูฝน', 'ฤดูใบไม้ผลิ', 'ฤดูใบไม้ร่วง'],
	},
	{
		question: 'เวลาหลับตาลงก่อนนอนคุณมักนึกถึงอะไร',
		answers: [
			'เรื่องราวที่เกิดขึ้นในวันนี้',
			'เรื่องที่จะเกิดขึ้นพรุ่งนี้',
			'คนที่คุณคิดถึง',
			'ไม่ได้นึกถึงอะไรเลย',
			'เรื่องราวเก่าๆ ที่เคยเกิดขึ้น',
		],
	},
	{
		question: '“มันคงจะดีถ้า...” เติมประโยคนี้ให้สมบูรณ์',
		answers: [
			'มีใครสักคนเคียงข้างฉันในวันที่เหนื่อยล้า',
			'ได้กาแฟซักแก้วเพื่อทำให้รู้สึกสดชื่นขึ้น',
			'มีเวลาว่างในวันหยุดมากกว่านี้',
			'ได้ปั่นจักรยานในสวนกับครอบครัว',
			'ได้กินอาหารอร่อยๆอย่างหนำใจ',
		],
	},
	{
		question:
			'หากคุณเดินสำรวจเกาะแห่งหนึ่งแล้วบังเอิญพบกับบ้านหลังหนึ่ง คุณคิดว่าบ้านหลังนั้นมีลักษณะแบบไหน',
		answers: [
			'กระท่อมหลังเล็กๆพอที่จะหลบฝนได้',
			'บ้านหนึ่งชั้นทั่วไปที่ดูอบอุ่นและน่าอยู่',
			'คฤหาสน์สุดหรูตกแต่งแบบทันสมัย',
			'บ้านร้างที่ทำจากไม้ค่อนข้างทรุดโทรม',
			'บ้านของชาวบ้านที่มีต้นไม้อยู่ล้อมรอบ',
		],
	},
	{
		question: 'เมื่อถึงวันเกิดของคุณ ของขวัญที่คุณอยากได้มากที่สุดคืออะไร',
		answers: [
			'เค้กน่ารักๆ ที่ประดับไปด้วยดอกไม้ที่คุณชอบ',
			'ขนมเล็กๆ น้อยๆ ไม่ต้องหวือหวา',
			'เครื่องประดับที่ทำจากหินหลากสี',
			'ของแฮนด์แมดที่ทำจากใจ',
			'ไม่ได้ต้องการอะไร ขอแค่คนรักอยู่ด้วยก็พอ',
		],
	},
];
