import echoImg from '@/assets/echoImg.svg';
import stillImg from '@/assets/stillImg.svg';
import whiteflagImg from '@/assets/whiteflagImg.svg';
import drizzleImg from '@/assets/drizzleImg.svg';
import bloomingImg from '@/assets/bloomingIng.svg';
import bdbubbaImg from '@/assets/bdbubbaImg.svg';
import taxi from '@/assets/taxiImg.svg';
import imissu from '@/assets/imissuwhenImg.svg';
import nomad from '@/assets/nomadImg.svg';
import imsaying from '@/assets/iamsayingImg.svg';

export type Result = {
	thainame?: string;
	engname: string;
	colorcode: string;
	img: string;
	desc: string[];
};

export const results: Result[] = [
	{
		thainame: 'เมื่อไหร่ที่คิดถึงเธอ',
		engname: '(Echo)',
		colorcode: '5A3F76',
		img: echoImg,
		desc: [
			'"ทุกฤดูกาลของคุณเต็มไปด้วยความหวังอยู่เสมอ',
			'อาจจะมีบางฤดูที่เรื่องราวในอดีตชอบมารบกวนทำให้ไม่ราบรื่น',
			'แต่คุณผ่านมันมาได้ตลอด เพราะพลังแห่งความหวังเล็กๆ',
			'ที่อยู่ในใจของคุณนั่นเองค่ะ"',
		],
	},
	{
		thainame: 'เกาะลอยฟ้า',
		engname: '(still)',
		colorcode: '7E55D9',
		img: stillImg,
		desc: [
			'"ลอยอยู่กลางนภาเฝ้าคิดถึงเธออย่างนั้น..',
			'ความคิดถึงเป็นสิ่งที่อยู่คู่กับชีวิตคุณมาตลอด',
			'ซึ่งมันเป็นเรื่องที่ดีและบางทีมันก็บั่นทอนคุณ',
			'แบบที่คุณไม่รู้ตัว ค่อยๆ สร้างเรื่องราวดีๆ ต่อไปนะคะ',
			'ในอนาคตคุณจะได้ยิ้มทุกครั้งที่คิดถึงมัน"',
		],
	},
	{
		thainame: 'ยอม',
		engname: '(White Flag)',
		colorcode: 'A740D9',
		img: whiteflagImg,
		desc: [
			'"บางทีเรื่องราวมากมายในแต่ละวันก็ชวนให้ปวดหัว',
			'ซะเหลือเกิน แต่มันจะผ่านพ้นไปได้แน่นอนค่ะ',
			'เพราะจริงๆ แล้วคุณเป็นคนที่มีพลังใจอยู่เสมอในการใช้ชีวิต',
			'อย่าลืมพักผ่อน และเติมพลังกับคนสำคัญของคุณนะคะ"',
		],
	},
	{
		thainame: 'ฤดูฝัน',
		engname: '(Drizzle)',
		colorcode: 'C88FDA',
		img: drizzleImg,
		desc: [
			'"ไม่ว่าจะฤดูกาลไหน ก็ถูกปกคลุมไปด้วยพลังแห่งความฝัน',
			'อยู่เสมอ ใช่ว่าคุณเป็นคนช่างฝันหวานอะไรขนาดนั้น',
			'แต่เพราะคุณมีพลังดีๆ ให้ตัวเองและคนอื่นอยู่เสมอ',
			'ทำให้ทุกคนพร้อมจะหยิบยื่นฝันที่ดีให้คุณเสมอมา',
			'ใช้ชีวิตของคุณให้งดงามเหมือนที่ฝันไว้นะคะ"',
		],
	},
	{
		thainame: 'เพลงรักเพลงแรก',
		engname: '(Blooming)',
		colorcode: 'BE3AC4',
		img: bloomingImg,
		desc: [
			'"ในที่สุดความหวานก็ถูกแผ่ออกครอบคลุมโลก',
			'ทั้งใบของคุณ การที่คุณได้เพลงนี้ นั่นแปลว่า',
			'คุณเป็นคนที่โรแมนติกสุดๆ เลยค่ะ ไม่ว่าใครที่คุยกับคุณ',
			'เขาจะสัมผัสถึงความใจดี มีเมตตาและความอบอุ่น',
			'ของคุณเสมอ รักษามันไว้นะคะ นั่นคือเสน่ห์ของคุณ"',
		],
	},
	{
		engname: 'B-D-BUB BA',
		colorcode: '953E95',
		img: bdbubbaImg,
		desc: [
			'"ในที่สุดความหวานก็ถูกแผ่ออกครอบคลุมโลก',
			'ทั้งใบของคุณ การที่คุณได้เพลงนี้ นั่นแปลว่า',
			'คุณเป็นคนที่โรแมนติกสุดๆ เลยค่ะ ไม่ว่าใครที่คุยกับคุณ',
			'เขาจะสัมผัสถึงความใจดี มีเมตตาและความอบอุ่น',
			'ของคุณเสมอ รักษามันไว้นะคะ นั่นคือเสน่ห์ของคุณ"',
		],
	},
	{
		engname: 'Taxi',
		colorcode: '7A4E6A',
		img: taxi,
		desc: [
			'"มันอาจจะดูเป็นเรื่องประหลาดที่คุณมักจะเจอแต่เรื่องแปลกๆ',
			'ที่ชวนให้ปวดหัวในแต่ละวัน แต่เชื่อเถอะค่ะ ว่าสุดท้ายคุณจะ',
			'สามารถตัดสินใจหรือหาทางออกดีๆที่ให้ตัวเองได้ เพราะสุดท้าย',
			'คุณคือคนที่กำหนดชีวิตของตัวเองและพลังใจอันแรงกล้า',
			'ของคุณจะช่วยพาคุณไปในที่ที่ดีกว่าเดิมแน่นอนค่ะ"',
		],
	},
	{
		engname: 'I miss u when I’m drunk',
		colorcode: '612D90',
		img: imissu,
		desc: [
			'"คุณเป็นคนที่เต็มที่กับการใช้ชีวิตมากๆ จนบ่อยครั้ง',
			'ไม่ทันรู้ตัวว่าเหนื่อยล้า และในบางครั้งคุณก็มักจะ',
			'จมอยู่กับอดีตแบบที่ไม่รู้ตัว แต่สักวันผลจากการที่คุณเต็มที่',
			'กับการใช้ชีวิตจะคืนกับมาตอบแทนคุณอย่างดีเยี่ยมแน่นอนค่ะ"',
		],
	},
	{
		thainame: 'ในวันพรุ่งนี้ขอให้เป็นวันที่ดี',
		engname: '(Nomad’s Lullaby)',
		colorcode: 'A18CC6',
		img: nomad,
		desc: [
			'"โลกสีเทาใบนี้เต็มไปด้วย อดีตและปัจจุบัน แต่ตัวคุณ',
			'มักจะคิดวนเวียนอยู่กับอนาคตอยู่บ่อยๆ และมีบางครั้ง',
			'ที่อดีตก็เข้ามารบกวนคุณโดยที่ไม่รู้ตัว อย่าละเลย',
			'ปัจจุบันของคุณนะคะ ใช้ชีวิตของคุณให้งดงามและ',
			'อย่าลืมปลอบโยนตัวเองในทุกๆ วันด้วยนะคะ"',
		],
	},
	{
		engname: 'I’m saying goodbye',
		colorcode: 'ECD8F2',
		img: imsaying,
		desc: [
			'"เวลายังเดินไปข้างหน้าอยู่เสมอ เช่นเดียวกับคุณที่ค่อยๆ',
			'เดินตามความฝันและแบบแผนที่วางไว้ในชีวิตไปเรื่อยๆ',
			'แต่มีบ่อยครั้งที่คุณมักจะหวนนึกถึงเรื่องราวในอดีต',
			'ที่ทำให้ขาของคุณไม่มีแรงที่จะก้าวต่อ แต่เชื่อเถอะค่ะ',
			'สักวันฤดูกาลใหม่จะมาถึงในไม่ช้า ขอให้เจอวันที่งดงามนะคะ"',
		],
	},
];
